#!/usr/bin/env python
# -*- coding: utf-8 -*-
from langconv import ConverterHandler
import time, codecs

def test():
    content1 = u'''哈利·S·杜鲁门（HarryS.Truman，1884年5月8日－1972年12月26日），美国民主党政治家，第34任副总统（1945年），随后接替因病逝世的富兰克林·D·罗斯福总统，成为了第33任美国总统（1945年－1953年）。
面对美国国内事务，杜鲁门总统正好遇上了新一-{轮混乱的经济衰退周期，当}-时物资短缺、有无数的-{罢工事件和有关否决《塔夫脱-哈}-特利法》的争议，都是当代的写照。杜鲁门虽于1948年成功连任总统，但却未能成功掌握国会的多数，以致于他的“良政”计划几乎全部流产。然而他曾率先以行政命令在美军内部施行废除种族隔离，并因应形势主持第二次“红色恐慌”，从政府部门辞退了数以千计可能影响国政的共产党同情者。不过，由于受到一连串的财政丑闻打击，有达数百位由他任命的官员必须辞职。
面对美国外交事务，-{zh-hans:杜鲁门;zh-hant:hhhhhhhh;zh-tw:44;}-总统任内发生了不少世界大事，首先是盟军战胜纳粹德-{国-{、-{广-{岛-{与-{-{-{-{-{-{-{-{-{-{长}-}-}-}-}-}-}-}-}-}-崎}-原}-子}-弹}-爆炸、日}-本-{投降和第二次世界大战}-的正式结束；接着是联合国的成立、以重建欧洲为旨的“马歇尔计划”的落实、杜鲁门主义对抗共产主义、冷战的开始、北约的成立以及朝鲜战争的爆发。其中朝鲜战争使美中韩三国付出了沉重的代价，其中只有苏联获取了实质利益。在美国方面，战争使44,000名美军阵亡和失踪，并直接破坏杜鲁门第二次连任的计划。最终，共和党的德怀特·艾森豪威尔凭借反对杜鲁门的运动与标语“韩国！共产主义！贪污！”（Korea!Communism!Corruption!）赢得人心，而在1952年出任总统，结束了民主党长达20年的执政。
杜鲁门是位素以友善和谦逊闻名的总统，他的不少名言，如“推卸责任止于此”（Thebuckstopshere!）和“怕热就别进厨房”（Ifyoucan'tstandtheheat,getoutofthekitchen.）[1]等等，都成为家喻户晓的名言。相比前任总统，杜鲁门的支持度不算高，但他谨慎果断的性格令他得以面对险峻的国际情势时，可以克服许多艰巨的挑战。尽管他最后在1952年被迫放弃竞选连任，但今日的历史学者仍视他为最出色的美国总统之一。
在1948年6月24日，苏联在未经咨议盟军的情况下，单方面中断了前往柏林美、英、法占区的陆地通道，而柏林正位于苏联所占的东德之内，显示出苏联有迫使盟国撤出西柏林的意思。结果，美国驻德国美占区的司令卢西乌斯·D·克雷（LuciusD.Clay）将军建议，沿着由西德至西柏林的高速公路，对西柏林进行大规模的空运物资，以示公义。空运本身将以完全和平的方式进行，但若果空运队伍遭受攻击或被迫中断，就应该作出防卫。然而，杜鲁门听取华盛顿的意见后，相信柏林空运计划很有可能会触发战争而表示忧虑。但最后在6月25日，盟国仍然决定对柏林空运，一直至1949年5月11日，前往西柏林的道路重开，空运行动才告结束。'''
    content2 = u'''-{哈}--{利}--{·}--{S}--{·}--{杜}--{鲁}--{门}--{（}--{H}--{a}--{r}--{r}--{y}--{S}--{.}--{T}--{r}--{u}--{m}--{a}--{n}--{，}--{1}--{8}--{8}--{4}--{年}--{5}--{月}--{8}--{日}--{－}--{1}--{9}--{7}--{2}--{年}--{1}--{2}--{月}--{2}--{6}--{日}--{）}--{，}--{美}--{国}--{民}--{主}--{党}--{政}--{治}--{家}--{，}--{第}--{3}--{4}--{任}--{副}--{总}--{统}--{（}--{1}--{9}--{4}--{5}--{年}--{）}--{，}--{随}--{后}--{接}--{替}--{因}--{病}--{逝}--{世}--{的}--{富}--{兰}--{克}--{林}--{·}--{D}--{·}--{罗}--{斯}--{福}--{总}--{统}--{，}--{成}--{为}--{了}--{第}--{3}--{3}--{任}--{美}--{国}--{总}--{统}--{（}--{1}--{9}--{4}--{5}--{年}--{－}--{1}--{9}--{5}--{3}--{年}--{）}--{。}-
-{面}--{对}--{美}--{国}--{国}--{内}--{事}--{务}--{，}--{杜}--{鲁}--{门}--{总}--{统}--{正}--{好}--{遇}--{上}--{了}--{新}--{一}--{轮}--{混}--{乱}--{的}--{经}--{济}--{衰}--{退}--{周}--{期}--{，}--{当}--{时}--{物}--{资}--{短}--{缺}--{、}--{有}--{无}--{数}--{的}--{罢}--{工}--{事}--{件}--{和}--{有}--{关}--{否}--{决}--{《}--{塔}--{夫}--{脱}--{-}--{哈}--{特}--{利}--{法}--{》}--{的}--{争}--{议}--{，}--{都}--{是}--{当}--{代}--{的}--{写}--{照}--{。}--{杜}--{鲁}--{门}--{虽}--{于}--{1}--{9}--{4}--{8}--{年}--{成}--{功}--{连}--{任}--{总}--{统}--{，}--{但}--{却}--{未}--{能}--{成}--{功}--{掌}--{握}--{国}--{会}--{的}--{多}--{数}--{，}--{以}--{致}--{于}--{他}--{的}--{“}--{良}--{政}--{”}--{计}--{划}--{几}--{乎}--{全}--{部}--{流}--{产}--{。}--{然}--{而}--{他}--{曾}--{率}--{先}--{以}--{行}--{政}--{命}--{令}--{在}--{美}--{军}--{内}--{部}--{施}--{行}--{废}--{除}--{种}--{族}--{隔}--{离}--{，}--{并}--{因}--{应}--{形}--{势}--{主}--{持}--{第}--{二}--{次}--{“}--{红}--{色}--{恐}--{慌}--{”}--{，}--{从}--{政}--{府}--{部}--{门}--{辞}--{退}--{了}--{数}--{以}--{千}--{计}--{可}--{能}--{影}--{响}--{国}--{政}--{的}--{共}--{产}--{党}--{同}--{情}--{者}--{。}--{不}--{过}--{，}--{由}--{于}--{受}--{到}--{一}--{连}--{串}--{的}--{财}--{政}--{丑}--{闻}--{打}--{击}--{，}--{有}--{达}--{数}--{百}--{位}--{由}--{他}--{任}--{命}--{的}--{官}--{员}--{必}--{须}--{辞}--{职}--{。}-
-{面}--{对}--{美}--{国}--{外}--{交}--{事}--{务}--{，}--{杜}--{鲁}--{门}--{总}--{统}--{任}--{内}--{发}--{生}--{了}--{不}--{少}--{世}--{界}--{大}--{事}--{，}--{首}--{先}--{是}--{盟}--{军}--{战}--{胜}--{纳}--{粹}--{德}--{国}--{、}--{广}--{岛}--{与}--{长}--{崎}--{原}--{子}--{弹}--{爆}--{炸}--{、}--{日}--{本}--{投}--{降}--{和}--{第}--{二}--{次}--{世}--{界}--{大}--{战}--{的}--{正}--{式}--{结}--{束}--{；}--{接}--{着}--{是}--{联}--{合}--{国}--{的}--{成}--{立}--{、}--{以}--{重}--{建}--{欧}--{洲}--{为}--{旨}--{的}--{“}--{马}--{歇}--{尔}--{计}--{划}--{”}--{的}--{落}--{实}--{、}--{杜}--{鲁}--{门}--{主}--{义}--{对}--{抗}--{共}--{产}--{主}--{义}--{、}--{冷}--{战}--{的}--{开}--{始}--{、}--{北}--{约}--{的}--{成}--{立}--{以}--{及}--{朝}--{鲜}--{战}--{争}--{的}--{爆}--{发}--{。}--{其}--{中}--{朝}--{鲜}--{战}--{争}--{使}--{美}--{中}--{韩}--{三}--{国}--{付}--{出}--{了}--{沉}--{重}--{的}--{代}--{价}--{，}--{其}--{中}--{只}--{有}--{苏}--{联}--{获}--{取}--{了}--{实}--{质}--{利}--{益}--{。}--{在}--{美}--{国}--{方}--{面}--{，}--{战}--{争}--{使}--{4}--{4}--{,}--{0}--{0}--{0}--{名}--{美}--{军}--{阵}--{亡}--{和}--{失}--{踪}--{，}--{并}--{直}--{接}--{破}--{坏}--{杜}--{鲁}--{门}--{第}--{二}--{次}--{连}--{任}--{的}--{计}--{划}--{。}--{最}--{终}--{，}--{共}--{和}--{党}--{的}--{德}--{怀}--{特}--{·}--{艾}--{森}--{豪}--{威}--{尔}--{凭}--{借}--{反}--{对}--{杜}--{鲁}--{门}--{的}--{运}--{动}--{与}--{标}--{语}--{“}--{韩}--{国}--{！}--{共}--{产}--{主}--{义}--{！}--{贪}--{污}--{！}--{”}--{（}--{K}--{o}--{r}--{e}--{a}--{!}--{C}--{o}--{m}--{m}--{u}--{n}--{i}--{s}--{m}--{!}--{C}--{o}--{r}--{r}--{u}--{p}--{t}--{i}--{o}--{n}--{!}--{）}--{赢}--{得}--{人}--{心}--{，}--{而}--{在}--{1}--{9}--{5}--{2}--{年}--{出}--{任}--{总}--{统}--{，}--{结}--{束}--{了}--{民}--{主}--{党}--{长}--{达}--{2}--{0}--{年}--{的}--{执}--{政}--{。}-
-{杜}--{鲁}--{门}--{是}--{位}--{素}--{以}--{友}--{善}--{和}--{谦}--{逊}--{闻}--{名}--{的}--{总}--{统}--{，}--{他}--{的}--{不}--{少}--{名}--{言}--{，}--{如}--{“}--{推}--{卸}--{责}--{任}--{止}--{于}--{此}--{”}--{（}--{T}--{h}--{e}--{b}--{u}--{c}--{k}--{s}--{t}--{o}--{p}--{s}--{h}--{e}--{r}--{e}--{!}--{）}--{和}--{“}--{怕}--{热}--{就}--{别}--{进}--{厨}--{房}--{”}--{（}--{I}--{f}--{y}--{o}--{u}--{c}--{a}--{n}--{'}--{t}--{s}--{t}--{a}--{n}--{d}--{t}--{h}--{e}--{h}--{e}--{a}--{t}--{,}--{g}--{e}--{t}--{o}--{u}--{t}--{o}--{f}--{t}--{h}--{e}--{k}--{i}--{t}--{c}--{h}--{e}--{n}--{.}--{）}--{[}--{1}--{]}--{等}--{等}--{，}--{都}--{成}--{为}--{家}--{喻}--{户}--{晓}--{的}--{名}--{言}--{。}--{相}--{比}--{前}--{任}--{总}--{统}--{，}--{杜}--{鲁}--{门}--{的}--{支}--{持}--{度}--{不}--{算}--{高}--{，}--{但}--{他}--{谨}--{慎}--{果}--{断}--{的}--{性}--{格}--{令}--{他}--{得}--{以}--{面}--{对}--{险}--{峻}--{的}--{国}--{际}--{情}--{势}--{时}--{，}--{可}--{以}--{克}--{服}--{许}--{多}--{艰}--{巨}--{的}--{挑}--{战}--{。}--{尽}--{管}--{他}--{最}--{后}--{在}--{1}--{9}--{5}--{2}--{年}--{被}--{迫}--{放}--{弃}--{竞}--{选}--{连}--{任}--{，}--{但}--{今}--{日}--{的}--{历}--{史}--{学}--{者}--{仍}--{视}--{他}--{为}--{最}--{出}--{色}--{的}--{美}--{国}--{总}--{统}--{之}--{一}--{。}-
-{在}--{1}--{9}--{4}--{8}--{年}--{6}--{月}--{2}--{4}--{日}--{，}--{苏}--{联}--{在}--{未}--{经}--{咨}--{议}--{盟}--{军}--{的}--{情}--{况}--{下}--{，}--{单}--{方}--{面}--{中}--{断}--{了}--{前}--{往}--{柏}--{林}--{美}--{、}--{英}--{、}--{法}--{占}--{区}--{的}--{陆}--{地}--{通}--{道}--{，}--{而}--{柏}--{林}--{正}--{位}--{于}--{苏}--{联}--{所}--{占}--{的}--{东}--{德}--{之}--{内}--{，}--{显}--{示}--{出}--{苏}--{联}--{有}--{迫}--{使}--{盟}--{国}--{撤}--{出}--{西}--{柏}--{林}--{的}--{意}--{思}--{。}--{结}--{果}--{，}--{美}--{国}--{驻}--{德}--{国}--{美}--{占}--{区}--{的}--{司}--{令}--{卢}--{西}--{乌}--{斯}--{·}--{D}--{·}--{克}--{雷}--{（}--{L}--{u}--{c}--{i}--{u}--{s}--{D}--{.}--{C}--{l}--{a}--{y}--{）}--{将}--{军}--{建}--{议}--{，}--{沿}--{着}--{由}--{西}--{德}--{至}--{西}--{柏}--{林}--{的}--{高}--{速}--{公}--{路}--{，}--{对}--{西}--{柏}--{林}--{进}--{行}--{大}--{规}--{模}--{的}--{空}--{运}--{物}--{资}--{，}--{以}--{示}--{公}--{义}--{。}--{空}--{运}--{本}--{身}--{将}--{以}--{完}--{全}--{和}--{平}--{的}--{方}--{式}--{进}--{行}--{，}--{但}--{若}--{果}--{空}--{运}--{队}--{伍}--{遭}--{受}--{攻}--{击}--{或}--{被}--{迫}--{中}--{断}--{，}--{就}--{应}--{该}--{作}--{出}--{防}--{卫}--{。}--{然}--{而}--{，}--{杜}--{鲁}--{门}--{听}--{取}--{华}--{盛}--{顿}--{的}--{意}--{见}--{后}--{，}--{相}--{信}--{柏}--{林}--{空}--{运}--{计}--{划}--{很}--{有}--{可}--{能}--{会}--{触}--{发}--{战}--{争}--{而}--{表}--{示}--{忧}--{虑}--{。}--{但}--{最}--{后}--{在}--{6}--{月}--{2}--{5}--{日}--{，}--{盟}--{国}--{仍}--{然}--{决}--{定}--{对}--{柏}--{林}--{空}--{运}--{，}--{一}--{直}--{至}--{1}--{9}--{4}--{9}--{年}--{5}--{月}--{1}--{1}--{日}--{，}--{前}--{往}--{西}--{柏}--{林}--{的}--{道}--{路}--{重}--{开}--{，}--{空}--{运}--{行}--{动}--{才}--{告}--{结}--{束}--{。}-'''

    content3 = u'麗著'
    content4 = u'-{哈利·S·-{杜鲁-{门（Ha-{rryS.Tru-{man，1884年5-{月8日－1972年12月26日），美国民主党政}-治家，第3}-4任副总统}-（194}-5年}-），随后}-'
    content5 = '外-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{-{内}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-}-外'
    content6 = codecs.open('testfile', 'r', 'utf-8').read()
    content = content6 * 1
    print len(content)
    convhandler = ConverterHandler('zh-hk')

    parserules = True

    times = 1

    while times:
        times -= 1
        start = time.time() # for debug
        a = convhandler.convert(content, parserules)
        print '%f sec.' % (time.time() - start) # for debug
        print a.encode('utf-8')
        print
        #time.sleep(50)
        """start = time.time() # for debug
        b = converter.convert(content, parserules)
        # for debug
        print '%f sec.' % (time.time() - start) # for debug
        #print b
    
        if a == b:
            print 'yes'"""
    #else:
    #    print repr(a)
    #    print repr(b)

if __name__ == '__main__':
    test()
